# 19: Formatting tampilan Data Frame

### Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional'] #label

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

   omset  operasional
0     16            1
1     13            2
2     15           15
3      2            6
4      1            8

In [4]:
df['omset'] = df['omset'] * 100_000 # (_) ignore character
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1600000        10000
1  1300000        20000
2  1500000       150000
3   200000        60000
4   100000        80000

In [6]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index() #menguba index saat ini menjadi kolom biasa dengan nama index
df = df.rename(columns={'index':'tanggal'})
df

D:\ANACONDA\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1600000        10000
1 2000-01-02  1300000        20000
2 2000-01-03  1500000       150000
3 2000-01-04   200000        60000
4 2000-01-05   100000        80000

### Melakukan formatting tampilan Data Frame

In [14]:
formatku = {'tanggal':'{:%d/%m/%y}', #format data string dengan memulai tanda {}
            'operasional':'Rp {:.2f}',
            'omset':'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [15]:
type(laporan)

pandas.io.formats.style.Styler

In [16]:
laporan.hide_index()

In [17]:
laporan.set_caption('Data Omset dan Operasional')

In [13]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')